tap "jmalloc/grit"

brew "adr-tools"
brew "asdf"
brew "clang-format" # needed for VSCode protobuf extension to support formatting
brew "colordiff"
brew "diff-so-fancy"
brew "direnv"
brew "gh"
brew "git"
brew "go"
brew "helm"
brew "jmalloc/grit/grit"
brew "jq"
brew "mob"
brew "node"
brew "vale"
brew "wdiff"
brew "z"
brew "zsh"

cask "font-victor-mono-nerd-font"
cask "visual-studio-code"

mas "Xcode", id: 497799835
mas "TestFlight", id: 899247664
mas "Developer", id: 640199958
